Revit 2026 API

# ExternalResourceReferenceIsValidReference Method

---

Checks whether the reference is in a valid format.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidReference(
	ExternalResourceType resourceType
)
```
```vb
Public Function IsValidReference (
	resourceType As ExternalResourceType
) As Boolean
```
```cpp
public:
bool IsValidReference(
	ExternalResourceType^ resourceType
)
```
```fsharp
member IsValidReference :
        resourceType : ExternalResourceType -> bool
```

#### Parameters

resourceType ExternalResourceType
     The type of resource which the ExternalResourceReference should correspond to.

#### Return Value

Boolean True if this is a valid ExternalResourceReference. False otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This function checks:

  * The server id corresponds to a valid server which implements IExternalResourceServer.
  * The server supports the given ExternalResourceType.
  * The reference information is well-formed.

This function does not check whether the resource exists on the server.

#### Reference

ExternalResourceReference Class

Autodesk.Revit.DB Namespace